app/views/services/index.html.erb

SELECT "services".* FROM "services"
---
   @services.each do |service|
     serv=service.service_translations.first