app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
   @events.each do |event|
     trans=event.event_translations.first