app/views/events/show.html.erb

			   end
			   @tipos=@event.event_types.all
---
SELECT "event_types".* FROM "event_types" WHERE (id = 5) ORDER BY "event_types"."id" ASC LIMIT 1

  <%
     @coments=CommentEvent.where("event_id=?",@event.id).all
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "1"]]