app/controllers/attractions_controller.rb

  def index
    unless(params[:search].nil?)
      @attractions = Attraction.search(params[:search],current_user)
    else
      @attractions= current_user.web_user.attractions if  current_user  && current_user.web_user
    end
    respond_to do |format|
      format.html{}
      format.json{render :json => Attraction.all.to_json({:include=>{:attraction_translations=>{:include=>:language},:city=>{:include=>:country},:photo_attractions=>{},:types=>{},:comment_attractions=>{:include=>:mobile_user}}})}
---
SELECT "attractions".* FROM "attractions"
SELECT "photo_attractions".* FROM "photo_attractions" WHERE "photo_attractions"."attraction_id" = $1 ORDER BY "photo_attractions"."id" ASC LIMIT 1  [["attraction_id", 1]]
SELECT COUNT(*) FROM "comment_attractions" WHERE "comment_attractions"."attraction_id" = $1  [["attraction_id", 1]]

  def show
    @attraction=Attraction.find(params[:id])
---
SELECT "attractions".* FROM "attractions" WHERE "attractions"."id" = $1 LIMIT 1  [["id", "1"]]