app/controllers/events_controller.rb

SELECT "events".* FROM "events"
SELECT COUNT(*) FROM "comment_events" WHERE "comment_events"."event_id" = $1  [["event_id", 1]]
---
  def index
    if (!params[:search].nil?)
      if (current_user.role? (:admin))
        @events =  Event.joins(:event_translations).where("event_translations.language_id=1 and LOWER(event_translations.name) LIKE LOWER(?)", "%#{params[:search]}%").page(params[:page]).per(10)
      else
        @events =  Event.joins(:event_translations).where("event_translations.language_id=1 and  events.web_user_id=? and LOWER(event_translations.name) LIKE LOWER(?)",current_user.id, "%#{params[:search]}%").page(params[:page]).per(10)
      end
    else
      if (!current_user.nil?) && (current_user.role? (:admin))
        @events = Event.page(params[:page]).per(10)
      else
        @events = current_user.web_user.events.page(params[:page]).per(10) if  current_user  && current_user.web_user
      end
    end
    respond_to do |format|
      format.html{}
      format.json{render :json => Event.page(params[:page]).per(25).as_json({:include=>{:event_translations=>{:include=>:language},:city=>{:include=>:country},:photo_events=>{},:types=>{},:comment_events=>{:include=>:mobile_user}}})}

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @events=Event.find(params[:id])