app/controllers/itineraries_controller.rb

SELECT "itineraries".* FROM "itineraries"
SELECT COUNT(*) FROM "comment_itineraries" WHERE "comment_itineraries"."itinerary_id" = $1  [["itinerary_id", 1]]
---
  def index
     if (!params[:search].nil?)
      if (current_user.role? (:admin))
        @itineraries = Itinerary.where("LOWER(name) LIKE LOWER(?)", "%#{params[:search]}%").page(params[:page]).per(10)
      else
        @itineraries = Itinerary.where("user_id=? and LOWER(name) LIKE LOWER(?)",current_user.id, "%#{params[:search]}%").page(params[:page]).per(10)
      end
    else
      if (current_user.role? (:admin))
        @itineraries=Itinerary.all.page(params[:page]).per(10)
      else
        @itineraries = current_user.itineraries.page(params[:page]).per(10) if  current_user
      end
    end
    respond_to do |format|
      format.html{ @itineraries }
      format.json{render :json =>  Itinerary.page(params[:page]).per(25).as_json( :include => {
          :itinerary_attractions=>{:include=>{:attraction=>{:include=>{:attraction_translations=>{:include=>:language},:city=>{:include=>:country},:photo_attractions=>{},:types=>{},:comment_attractions=>{:include=>:mobile_user}}}}},
          :itinerary_events=>{:include=>{:event=>{:include=>{:event_translations=>{:include=>:language},:city=>{:include=>:country},:photo_events=>{},:types=>{},:comment_events=>{:include=>:mobile_user}}}}},
          :itinerary_services=>{:include=>{:service=>{:include=>{:service_translations=>{:include=>:language},:city=>{:include=>:country},:photo_services=>{},:types=>{},:comment_services=>{:include=>:mobile_user}}}}},
          :comment_itineraries=>{:include=>{:mobile_user=>{}}},
          :rating_itineraries=>{:include=>{:mobile_user=>{}}}
      }) }