app/controllers/services_controller.rb

  def index
     if (!current_user.nil?) && (current_user.role? (:admin))
       @services = Service.all.page(params[:page]).per(10)
    else
      unless(params[:search].nil?)
        @services = Service.search(params[:search],current_user).page(params[:page]).per(10)
      else
        @services = current_user.web_user.services.page(params[:page]).per(10) if  current_user  && current_user.web_user
      end
      respond_to do |format|
        format.html{@services.page(params[:page]).per(10)}
        format.json{render :json => Service.page(params[:page]).per(25).as_json({:include=>{:service_translations=>{:include=>:language},:city=>{:include=>:country},:photo_services=>{},:types=>{},:comment_services=>{:include=>:mobile_user}}})}
---
SELECT "services".* FROM "services"
SELECT COUNT(*) FROM "comment_services" WHERE "comment_services"."service_id" = $1  [["service_id", 4]]