app/views/attractions/index.html.erb

SELECT "attractions".* FROM "attractions"
---
   @attractions.each do |attraction|
    trans=attraction.attraction_translations.first

SELECT "photo_attractions".* FROM "photo_attractions" WHERE "photo_attractions"."attraction_id" = $1 ORDER BY "photo_attractions"."id" ASC LIMIT 1  [["attraction_id", 1]]
---
          <div class="col-xs-3 col-md-3 text-center">
            <%	unless attraction.photo_attractions.first.nil? %>