app/views/attractions/show.html.erb

           end
           @tipos=@attraction.attraction_types.all
---
SELECT "attraction_types".* FROM "attraction_types" WHERE (id = 5) ORDER BY "attraction_types"."id" ASC LIMIT 1

  <%
     @coments=CommentAttraction.where("attraction_id=?",@attraction.id).all
---
SELECT "attractions".* FROM "attractions" WHERE "attractions"."id" = $1 LIMIT 1  [["id", "1"]]